Dlubal.RFEM5.FreeRectangularLoad
Free rectangular load parameters.

Dlubal.RFEM5.FreeRectangularLoad.No
Number

Dlubal.RFEM5.FreeRectangularLoad.ID
Identifier

Dlubal.RFEM5.FreeRectangularLoad.Comment
Comment

Dlubal.RFEM5.FreeRectangularLoad.Tag
Tag

Dlubal.RFEM5.FreeRectangularLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.FreeRectangularLoad.SurfaceList
List of surfaces on which is load defined.

Dlubal.RFEM5.FreeRectangularLoad.ProjectionPlane
Projection plane of load

Dlubal.RFEM5.FreeRectangularLoad.Direction
Load direction

Dlubal.RFEM5.FreeRectangularLoad.Distribution
Load distribution

Dlubal.RFEM5.FreeRectangularLoad.Magnitude1
Magnitude of load at the first position.

Dlubal.RFEM5.FreeRectangularLoad.Magnitude2
Magnitude of load at the second position.

Dlubal.RFEM5.FreeRectangularLoad.Position1
First position of the load.

Dlubal.RFEM5.FreeRectangularLoad.Position2
Second position of the load.